{"pageId":"/pages/docs","routeParams":{"splat":"guides"},"data":{"doc":{"path":"/docs/guides","filePath":"/home/runner/work/isolated-workers/isolated-workers/docs/guides/index.md","title":"Guides","description":"In-depth guides for isolated-workers","nav":{"section":"Guides","order":0}},"segments":[{"type":"html","html":"<h1>Guides</h1>\n<p>These guides provide in-depth coverage of specific isolated-workers topics.</p>\n<h2>Core Concepts</h2>\n<h3><a href=\"/isolated-workers/docs/guides/error-handling\">Error Handling</a></h3>\n<p>Learn how errors thrown in worker processes propagate back to the host, including error serialization across process boundaries, proper try/catch patterns, and error message preservation.</p>\n<h3><a href=\"/isolated-workers/docs/guides/worker-lifecycle\">Worker Lifecycle</a></h3>\n<p>Managing worker state, status checks, and graceful shutdown. Learn about state persistence across messages, health checks, and proper cleanup patterns.</p>\n<h2>Configuration</h2>\n<h3><a href=\"/isolated-workers/docs/guides/timeout-configuration\">Timeout Configuration</a></h3>\n<p>Configure timeouts for worker startup, connection, and per-message-type operations. Essential for long-running tasks and responsive health checks.</p>\n<h3><a href=\"/isolated-workers/docs/guides/shutdown-handling\">Shutdown Handling</a></h3>\n<p>Configure how workers handle unexpected crashes (OOM, SIGKILL, hard crashes). Learn about crash detection, reject/retry strategies, and per-message-type overrides for handling pending operations.</p>\n<h3><a href=\"/isolated-workers/docs/guides/custom-serializers\">Custom Serializers</a></h3>\n<p>Use custom serialization for binary formats like MessagePack, add compression, or implement encryption for sensitive data crossing process boundaries.</p>\n<h2>Advanced Patterns</h2>\n<h3><a href=\"/isolated-workers/docs/guides/middleware\">Middleware</a></h3>\n<p>Intercept and transform messages with middleware pipelines. Useful for logging, validation, timing, and adding metadata to messages.</p>\n<h3><a href=\"/isolated-workers/docs/guides/testing\">Testing Workers</a></h3>\n<p>Strategies for testing worker-based code. Covers unit testing handlers in isolation, integration testing with real workers, mocking workers for host-side tests, and CI considerations.</p>\n<h3><a href=\"/isolated-workers/docs/guides/security\">Security Considerations</a></h3>\n<p>Security best practices for worker-based applications. Understand what isolation process separation provides, socket security, message validation, and when additional sandboxing is needed.</p>"}]}}